Revit 2027 API
Application.NewPointOnEdgeEdgeIntersection Method
Construct a PointOnEdgeEdgeIntersection object which is used to define the placement of a ReferencePoint given two references to edge.
Namespace: Autodesk.Revit.Creation
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public PointOnEdgeEdgeIntersection NewPointOnEdgeEdgeIntersection(
	Reference edgeReference1,
	Reference edgeReference2
)
Public Function NewPointOnEdgeEdgeIntersection (
	edgeReference1 As Reference,
	edgeReference2 As Reference
) As PointOnEdgeEdgeIntersection
public:
PointOnEdgeEdgeIntersection^ NewPointOnEdgeEdgeIntersection(
	Reference^ edgeReference1,
	Reference^ edgeReference2
)
member NewPointOnEdgeEdgeIntersection :
        edgeReference1 : Reference *
        edgeReference2 : Reference -> PointOnEdgeEdgeIntersection
Parameters
edgeReference1 Reference
The first edge reference.
edgeReference2 Reference
The second edge reference.
Return Value
PointOnEdgeEdgeIntersection
A new PointOnEdgeEdgeIntersection object.
Exceptions
Exception | Condition
ArgumentNullException |  Thrown when the input argument edgeReference1 or edgeReference2 is null.
See Also
Reference
Application Class
Autodesk.Revit.Creation Namespace